Catalogs/МестаХранения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>МестаХранения</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НомерСклада</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерРяда</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПолки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЯчейки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/МестаХранения/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ОбработкаЗаписиНовогоНаСервере()
	Объект.Наименование=Объект.НомерСклада+"/"+Прав("0"+Строка(Объект.НомерРяда),2)+Прав("0"+Строка(Объект.НомерПолки),2)+Прав("0"+Строка(Объект.НомерЯчейки),2);
	//Вставить содержимое обработчика
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	ОбработкаЗаписиНовогоНаСервере();
КонецПроцедуры

&НаСервере
Процедура НомерПолкиПриИзмененииНаСервере()
	Объект.Наименование=Прав("00"+Строка(Объект.НомерСклада),2)+"/"+Прав("00"+Строка(Объект.НомерРяда),2)+"/"+Прав("00"+Строка(Объект.НомерПолки),2);
КонецПроцедуры

&НаКлиенте
Процедура НомерПолкиПриИзменении(Элемент)
	НомерПолкиПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура НомерЯчейкиПриИзменении(Элемент)
	ОбработкаЗаписиНовогоНаСервере();
КонецПроцедуры
